Catalogs/ИнформационныеКарты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<Catalog>
		<Properties>
			<Name>ИнформационныеКарты</Name>
			<Comment>(Упр) Магнитные и штриховые карты.</Comment>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидДисконтнойКарты</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыДисконтныхКарт</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидКарты</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыИнформационныхКарт</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВладелецКарты</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодКарты</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Р_ВыгружатьНаПОС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Р_ДатаНачалаДействия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Р_ДатаОкончанияДействия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Р_Заблокирована</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Р_НомерЧекаРегистрации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Р_РучнойПроцентБонуса</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Р_ФиксированныйПроцентДисконта</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Реферал</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИнформационныеКарты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипКарты</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыИнформационныхКарт</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипШтрихКода</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.ТипыШтрихкодов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьПроцентСкидки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьЭтоПрефиксКода</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СМС_Информирование</Name>
					<Comment>смс информирование</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Enums/ТипыИнформационныхКарт.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<Enum>
		<Properties>
			<Name>ТипыИнформационныхКарт</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Дисконтная</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Регистрационная</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Р_Бонусная</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/ФизическиеЛица.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<Catalog>
		<Properties>
			<Name>ФизическиеЛица</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаРождения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пол</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Пол</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодПоДРФО</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтраховойНомерПФ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>14</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Телефон</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>13</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>email</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>КонтактнаяИнформация</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Тип</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ТипыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Вид</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>500</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначенияПолей</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Страна</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Регион</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Город</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АдресЭП</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДоменноеИмяСервера</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефона</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефонаБезКодов</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/ИнформационныеКарты/Forms/Генератор/Ext/Form/Module.bsl
#Область ОбработчикиСобытий

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(отказ, проверяемыеРеквизиты)
	
	максКоличествоКартРегиона = 999999;
	Если НачальныйНомер + КоличествоКарт > максКоличествоКартРегиона Тогда
	
		//отказ = Истина;
		
		текстСообщения = НСтр("ru = 'Конечное количество информационных карт для региона не может превышать значение [МаксКоличествоКартРегиона]. Измените значение начального номера и/или количества карт.'");
		текстСообщения = СтрЗаменить(текстСообщения, "[МаксКоличествоКартРегиона]", максКоличествоКартРегиона);
		
		ПроверкаДанныхКлиентСервер.СообщитьОбОшибке(отказ, текстСообщения, ЭтотОбъект, "НачальныйНомер",,УникальныйИдентификатор);
		
		//сообщение = Новый СообщениеПользователю;
		//сообщение.Текст = ТекстСообщения;
		//сообщение.ИдентификаторНазначения = УникальныйИдентификатор;
		//сообщение.Сообщить();
	
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ДействияКоманд

&НаКлиенте
Процедура Создать(Команда)
	
	Если Не ПроверитьЗаполнение() Тогда
		Возврат;
	КонецЕсли; 
	
	Состояние(НСтр("ru = 'Выполняется создание информационных карт...'"));
	Если СоздатьНаСервере() Тогда
		
		ОповеститьОбИзменении(Тип("СправочникСсылка.ИнформационныеКарты"));
		ПоказатьПредупреждение(, НСтр("ru = 'Создание информационных карт завершено.'"));		
		
	Иначе
		ПоказатьПредупреждение(, НСтр("ru = 'В процессе создания информационных карт возникли ошибки. Информационные карты не созданы.'"));
	КонецЕсли; 
	
КонецПроцедуры

#КонецОбласти

#Область ДополнительныеПроцедурыИФункции

// Выполняет непосредственное создание информационных карт.
//
// Возвращаемое значение:
//   Булево   - Истина - информационные карты созданы успешно; Ложь - в противном случае.
//
&НаСервере
Функция СоздатьНаСервере()

	НачатьТранзакцию();
	
	блокировкаДанных = Новый БлокировкаДанных;
	элементБлокировки = БлокировкаДанных.Добавить("Справочник.ИнформационныеКарты");
	элементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	блокировкаДанных.Заблокировать();
	
	отказ = Ложь;
	
	Для к = НачальныйНомер По НачальныйНомер + КоличествоКарт - 1 Цикл
		
		кодКарты = "[КодРегиона]000[ПорядковыйНомер]";
		кодКарты = СтрЗаменить(КодКарты, "[КодРегиона]", Формат(КодРегиона, "ЧЦ=3; ЧВН="));
		кодКарты = СтрЗаменить(КодКарты, "[ПорядковыйНомер]", Формат(к, "ЧЦ=6; ЧВН=; ЧГ="));
		кодКарты = КодКарты + ПодключаемоеОборудованиеКлиентСервер.КонтрольныйСимволEAN13(КодКарты);
		
		информационнаяКарта = СоздатьИнформационнуюКарту(кодКарты);
		Если информационнаяКарта = Неопределено Тогда
			
			отказ = Истина;
			Прервать;
			
		КонецЕсли; 
	
	КонецЦикла; 
	
	Если отказ Тогда
		ОтменитьТранзакцию();
	Иначе
		ЗафиксироватьТранзакцию();
	КонецЕсли; 
	
	Возврат Не отказ;

КонецФункции // СформироватьНаСервере()

// Создаёт владельца информационной карты.
//
// Параметры:
//  КодКарты  - Строка - Код создаваемой информационной карты. Будет использовать
//                 как часть наименования физического лица.
//
// Возвращаемое значение:
//   СправочникСсылка.ФизическиеЛица, Неопределено   - Ссылка на созданного владельца
//                 карты. Если владелец не был создан, будет возвращено значение
//                 Неопределено.
//
&НаСервере
Функция СоздатьВладельцаКарты(КодКарты)

	Наименование = НСтр("ru = '<Укажите ФИО> - [КодКарты]'");
	Наименование = СтрЗаменить(Наименование, "[КодКарты]", КодКарты);
	
	физическиеЛицаОбъект = Справочники.ФизическиеЛица.СоздатьЭлемент();
	
	физическиеЛицаОбъект.ОбменДанными.Загрузка = Истина;
	ФизическиеЛицаОбъект.Заполнить(Неопределено);
	ФизическиеЛицаОбъект.Наименование = Наименование;
	
	Если Не ФизическиеЛицаОбъект.ПроверитьЗаполнение() Тогда
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = ОбщегоНазначенияСервер.ПолучитьТекстСообщенийПользователю();
		Сообщение.ИдентификаторНазначения = УникальныйИдентификатор;
		Сообщение.Сообщить();
	
		Возврат Неопределено;
	
	КонецЕсли; 
	
	Попытка
		ФизическиеЛицаОбъект.Записать();
	Исключение
	
		ИнформацияОбОшибке = ИнформацияОбОшибке();
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = НСтр("ru = 'Описание ошибки: '") + КраткоеПредставлениеОшибки(ИнформацияОбОшибке);
		Сообщение.Сообщить();
		
		Возврат Неопределено;
	
	КонецПопытки;
	
	Возврат ФизическиеЛицаОбъект.Ссылка;

КонецФункции // СоздатьВладельцаКарты()

// Создаёт информационную карту.
//
// Параметры:
//  КодКарты  - Строка - Код создаваемой информационной карты. Будет использовать
//                 как часть наименования физического лица.
//
// Возвращаемое значение:
//   СправочникСсылка.ИнформационныеКарты, Неопределено   - Ссылка на созданную
//                 карту. Если карта не была создана, будет возвращено значение
//                 Неопределено.
//
&НаСервере
Функция СоздатьИнформационнуюКарту(кодКарты)

	владелецКарты = СоздатьВладельцаКарты(кодКарты);
	Если владелецКарты = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли; 
	
	информационныеКартыОбъект = Справочники.ИнформационныеКарты.СоздатьЭлемент();

	информационныеКартыОбъект.Заполнить(Неопределено);
	
	информационныеКартыОбъект.Наименование 		= КодКарты;
	информационныеКартыОбъект.КодКарты 			= КодКарты;
	информационныеКартыОбъект.ВидКарты 			= Перечисления.ВидыИнформационныхКарт.Штриховая;
	информационныеКартыОбъект.ТипШтрихКода 		= ПланыВидовХарактеристик.ТипыШтрихкодов.EAN13;
	информационныеКартыОбъект.ТипКарты 			= Перечисления.ТипыИнформационныхКарт.Р_Бонусная;
	информационныеКартыОбъект.Р_ВыгружатьНаПОС 	= Истина;
	информационныеКартыОбъект.ВладелецКарты 	= ВладелецКарты;
	информационныеКартыОбъект.СМС_Информирование = Истина;
	
	Если Р_РучнойПроцентБонуса <> 0 Тогда
		информационныеКартыОбъект.Р_РучнойПроцентБонуса = Р_РучнойПроцентБонуса;
		информационныеКартыОбъект.ТипКарты = Перечисления.ТипыИнформационныхКарт.Дисконтная;
	КонецЕсли;
	
	информационныеКартыОбъект.УстановитьНовыйКод();
	
	информационныеКартыОбъект.ОбменДанными.Загрузка = Истина;
	
	ПодключаемоеОборудованиеКлиентСервер.ЗарегистрироватьИнформационнуюКартуВручную(информационныеКартыОбъект);
	
	Если Не информационныеКартыОбъект.ПроверитьЗаполнение() Тогда
		
		сообщение = Новый СообщениеПользователю;
		сообщение.Текст = ОбщегоНазначенияСервер.ПолучитьТекстСообщенийПользователю();
		сообщение.ИдентификаторНазначения = УникальныйИдентификатор;
		сообщение.Сообщить();
	
		Возврат Неопределено;
	
	КонецЕсли; 
	
	Попытка
		информационныеКартыОбъект.Записать();
	Исключение
	
		информацияОбОшибке = ИнформацияОбОшибке();
		
		сообщение = Новый СообщениеПользователю;
		сообщение.Текст = НСтр("ru = 'Описание ошибки: '") + КраткоеПредставлениеОшибки(информацияОбОшибке);
		сообщение.Сообщить();
		
		Возврат Неопределено;
	
	КонецПопытки;
	
	Возврат информационныеКартыОбъект.Ссылка;

КонецФункции // СоздатьИнформационнуюКарту()

#КонецОбласти
